livekit/client-sdk-esp32/components/livekit/examples/minimal/main/board.c
#include "esp_log.h"
#include "esp_check.h"
#include "esp_timer.h"

#include <math.h>
#include <string.h>
#include <stdio.h>
#include <stdint.h>
#include <stdbool.h>

#include "bsp/esp32_s3_touch_amoled_2_06.h"
#include "lvgl.h"

#include "freertos/FreeRTOS.h"
#include "freertos/task.h"
#include "freertos/queue.h"

#include "board.h"
#include "media.h"

static const char *TAG = "board";

// Some IDE/lint setups don't automatically include the generated `sdkconfig.h`.
// Keep this as a harmless fallback to avoid false-positive diagnostics.
#ifndef CONFIG_LK_EXAMPLE_CODEC_BOARD_TYPE
#define CONFIG_LK_EXAMPLE_CODEC_BOARD_TYPE "UNUSED"
#endif

// This example uses the Waveshare ESP32-S3-Touch-AMOLED-2.06 BSP to initialize audio I/O.
static esp_codec_dev_handle_t s_mic_handle = NULL;
static esp_codec_dev_handle_t s_spk_handle = NULL;

// UI visualizer state.
static lv_obj_t *s_visualizer_bar = NULL;
static lv_obj_t *s_visualizer_dot = NULL;
static lv_timer_t *s_visualizer_timer = NULL;
static volatile uint16_t s_visualizer_level_q15 = 0; // updated from audio thread
static uint16_t s_visualizer_display_q15 = 0;        // smoothed display value

// LiveKit connection indicator (replaces remote volume meter while disconnected/connecting).
static lv_obj_t *s_conn_dot = NULL;
static livekit_connection_state_t s_conn_state = LIVEKIT_CONNECTION_STATE_DISCONNECTED;
static bool s_room_connected = false;

// Mic input visualizer + mute indicator (top-center).
static lv_obj_t *s_mic_level_cont = NULL;
static lv_obj_t *s_mic_level_bar = NULL;
static lv_obj_t *s_mic_level_dot = NULL;
static volatile uint16_t s_mic_level_q15 = 0; // updated from capture/audio thread
static uint16_t s_mic_level_display_q15 = 0;  // smoothed display value

// Mic meter UI curve:
// Map linear amplitude [0..1] to a "more sensitive" UI level [0..1] so
// quiet speech is visible while loud speech doesn't instantly peg.
//
// y = log1p(k*x) / log1p(k)
// - k larger => more boost in the low range, more compression in the high range.
#define LK_MIC_UI_CURVE_K 20.0f

// Rate-limited console logging for levels (avoid spamming UART).
static int64_t s_level_log_last_us = 0;
static void board_level_log_maybe(void)
{
    const int64_t now = esp_timer_get_time();
    // Log at most once per second.
    if (now - s_level_log_last_us < 1000000) return;
    s_level_log_last_us = now;

    const float spk = (float)s_visualizer_level_q15 / 32767.0f;
    const float mic = (float)s_mic_level_q15 / 32767.0f;
    ESP_LOGI(TAG, "levels: spk=%.3f mic=%.3f%s", (double)spk, (double)mic,
             media_get_mic_muted() ? " (mic muted)" : "");
}

// Upper button → mute toggle task plumbing.
typedef struct {
    bsp_button_t button;
} board_button_evt_t;
static QueueHandle_t s_button_queue = NULL;
static TaskHandle_t s_button_task = NULL;

static void board_mic_indicator_apply(bool muted)
{
    if (s_mic_level_cont == NULL) return;

    // Per UX:
    // - When muted: show a red dot (no bars)
    // - When unmuted: show a blue dot when silent/low, or blue gradient bars when speaking
    lv_obj_clear_flag(s_mic_level_cont, LV_OBJ_FLAG_HIDDEN);

    if (s_mic_level_dot) {
        lv_obj_set_style_bg_color(s_mic_level_dot, muted ? lv_color_hex(0xFF0000) : lv_color_hex(0x3B82F6), 0);
    }
    if (muted) {
        if (s_mic_level_bar) lv_obj_add_flag(s_mic_level_bar, LV_OBJ_FLAG_HIDDEN);
        if (s_mic_level_dot) lv_obj_clear_flag(s_mic_level_dot, LV_OBJ_FLAG_HIDDEN);
    }
}

static void board_visualizer_timer_cb(lv_timer_t *t)
{
    (void)t;
    if (s_visualizer_bar == NULL) return;

    // While not connected, suppress remote volume indicator entirely.
    if (!s_room_connected) {
        lv_obj_add_flag(s_visualizer_bar, LV_OBJ_FLAG_HIDDEN);
        if (s_visualizer_dot) lv_obj_add_flag(s_visualizer_dot, LV_OBJ_FLAG_HIDDEN);
        goto mic_update;
    }

    const uint16_t target = s_visualizer_level_q15;
    uint16_t cur = s_visualizer_display_q15;

    // Simple peak-hold + exponential decay for a pleasant “meter” feel.
    if (target > cur) {
        cur = target;
    } else {
        // decay ~10% per tick (~33ms default) => fast falloff
        cur = (uint16_t)((uint32_t)cur * 9U / 10U);
    }
    s_visualizer_display_q15 = cur;

    const int32_t v = (int32_t)((uint32_t)cur * 100U / 32767U); // 0..100

    // Switch to the silent dot as soon as the bar would be smaller than the dot.
    // This avoids a visible “jump” between a tiny bar and the (20px) dot.
    const int32_t bar_w = lv_obj_get_width(s_visualizer_bar);
    const int32_t dot_d = s_visualizer_dot ? lv_obj_get_width(s_visualizer_dot) : 20;
    // In RANGE mode with [-100..100] and start=-v/value=+v, the total filled width is v% of the bar.
    const int32_t fill_px = (bar_w > 0) ? (int32_t)(((int64_t)bar_w * (int64_t)v) / 100) : 0;
    const bool show_dot = (v == 0) || (fill_px < dot_d);

    if (show_dot) {
        lv_bar_set_start_value(s_visualizer_bar, 0, LV_ANIM_OFF);
        lv_bar_set_value(s_visualizer_bar, 0, LV_ANIM_OFF);
        lv_obj_add_flag(s_visualizer_bar, LV_OBJ_FLAG_HIDDEN);
        if (s_visualizer_dot) lv_obj_clear_flag(s_visualizer_dot, LV_OBJ_FLAG_HIDDEN);
        goto mic_update;
    }

    lv_obj_clear_flag(s_visualizer_bar, LV_OBJ_FLAG_HIDDEN);
    if (s_visualizer_dot) lv_obj_add_flag(s_visualizer_dot, LV_OBJ_FLAG_HIDDEN);

    // Center-out meter: fill from -v..+v.
    // LVGL v9 bar supports RANGE mode (start_value..value).
    lv_bar_set_start_value(s_visualizer_bar, -v, LV_ANIM_OFF);
    lv_bar_set_value(s_visualizer_bar, v, LV_ANIM_OFF);

    // ---- Mic input indicator (top) ----
mic_update:
    if (s_mic_level_cont == NULL) return;

    // If muted: force red dot visible and keep bars hidden.
    if (media_get_mic_muted()) {
        if (s_mic_level_dot) {
            lv_obj_set_style_bg_color(s_mic_level_dot, lv_color_hex(0xFF0000), 0);
            lv_obj_clear_flag(s_mic_level_dot, LV_OBJ_FLAG_HIDDEN);
        }
        if (s_mic_level_bar) lv_obj_add_flag(s_mic_level_bar, LV_OBJ_FLAG_HIDDEN);
        return;
    }
    // Unmuted: blue styling (dot vs bars decided below).
    if (s_mic_level_dot) {
        lv_obj_set_style_bg_color(s_mic_level_dot, lv_color_hex(0x3B82F6), 0);
    }

    const uint16_t mic_target = s_mic_level_q15;
    uint16_t mic_cur = s_mic_level_display_q15;
    if (mic_target > mic_cur) {
        mic_cur = mic_target;
    } else {
        mic_cur = (uint16_t)((uint32_t)mic_cur * 9U / 10U);
    }
    s_mic_level_display_q15 = mic_cur;

    int32_t mic_v = (int32_t)((uint32_t)mic_cur * 100U / 32767U); // 0..100
    // Small noise floor to prevent flicker from codec/AEC background noise.
    if (mic_v < 2) mic_v = 0;

