livekit/client-sdk-esp32/components/livekit/examples/minimal/main/board.c
    // Only switch to bar view when the filled width exceeds the 20px dot.
    const int32_t mic_bar_w = s_mic_level_bar ? lv_obj_get_width(s_mic_level_bar) : 0;
    const int32_t mic_dot_d = s_mic_level_dot ? lv_obj_get_width(s_mic_level_dot) : 20;
    const int32_t mic_fill_px = (mic_bar_w > 0) ? (int32_t)(((int64_t)mic_bar_w * (int64_t)mic_v) / 100) : 0;
    const bool mic_show_dot = (mic_v == 0) || (mic_fill_px <= mic_dot_d);

    if (mic_show_dot) {
        if (s_mic_level_bar) {
            lv_bar_set_start_value(s_mic_level_bar, 0, LV_ANIM_OFF);
            lv_bar_set_value(s_mic_level_bar, 0, LV_ANIM_OFF);
            lv_obj_add_flag(s_mic_level_bar, LV_OBJ_FLAG_HIDDEN);
        }
        if (s_mic_level_dot) lv_obj_clear_flag(s_mic_level_dot, LV_OBJ_FLAG_HIDDEN);
        return;
    }

    if (s_mic_level_bar) lv_obj_clear_flag(s_mic_level_bar, LV_OBJ_FLAG_HIDDEN);
    if (s_mic_level_dot) lv_obj_add_flag(s_mic_level_dot, LV_OBJ_FLAG_HIDDEN);
    if (s_mic_level_bar) {
        lv_bar_set_start_value(s_mic_level_bar, -mic_v, LV_ANIM_OFF);
        lv_bar_set_value(s_mic_level_bar, mic_v, LV_ANIM_OFF);
    }
}

static void board_conn_dot_anim_exec_cb(void *obj, int32_t v)
{
    // Translate relative to center to keep alignment stable.
    lv_obj_set_style_translate_x((lv_obj_t *)obj, (lv_coord_t)v, 0);
}

static void board_conn_ui_apply_locked(livekit_connection_state_t state)
{
    if (s_conn_dot == NULL || s_visualizer_bar == NULL) return;

    s_conn_state = state;
    const bool connecting = (state == LIVEKIT_CONNECTION_STATE_CONNECTING) ||
                            (state == LIVEKIT_CONNECTION_STATE_RECONNECTING);
    const bool connected = (state == LIVEKIT_CONNECTION_STATE_CONNECTED);
    const bool disconnected = (state == LIVEKIT_CONNECTION_STATE_DISCONNECTED) ||
                              (state == LIVEKIT_CONNECTION_STATE_FAILED);

    s_room_connected = connected;

    if (connected) {
        // Hide the connection dot and show the regular remote meter.
        lv_anim_del(s_conn_dot, board_conn_dot_anim_exec_cb);
        lv_obj_set_style_translate_x(s_conn_dot, 0, 0);
        lv_obj_add_flag(s_conn_dot, LV_OBJ_FLAG_HIDDEN);

        // Ensure the meter has a sane initial appearance; timer will take over.
        lv_obj_add_flag(s_visualizer_bar, LV_OBJ_FLAG_HIDDEN);
        if (s_visualizer_dot) lv_obj_clear_flag(s_visualizer_dot, LV_OBJ_FLAG_HIDDEN);
        s_visualizer_display_q15 = 0;
        return;
    }

    // Disconnected / connecting: hide remote meter and show connection dot.
    lv_obj_add_flag(s_visualizer_bar, LV_OBJ_FLAG_HIDDEN);
    if (s_visualizer_dot) lv_obj_add_flag(s_visualizer_dot, LV_OBJ_FLAG_HIDDEN);
    lv_obj_clear_flag(s_conn_dot, LV_OBJ_FLAG_HIDDEN);
    lv_obj_align(s_conn_dot, LV_ALIGN_CENTER, 0, 0);

    // Stop any prior anim and reset translation.
    lv_anim_del(s_conn_dot, board_conn_dot_anim_exec_cb);
    lv_obj_set_style_translate_x(s_conn_dot, 0, 0);

    if (connecting) {
        // Animate left/right by ~40px total (±20px), 0.5Hz (2s full cycle).
        lv_anim_t a;
        lv_anim_init(&a);
        lv_anim_set_var(&a, s_conn_dot);
        lv_anim_set_exec_cb(&a, board_conn_dot_anim_exec_cb);
        lv_anim_set_values(&a, -20, 20);
        lv_anim_set_time(&a, 1000);
        lv_anim_set_playback_time(&a, 1000);
        lv_anim_set_repeat_count(&a, LV_ANIM_REPEAT_INFINITE);
        lv_anim_start(&a);
    } else if (disconnected) {
        // Static dot centered.
        (void)disconnected;
    }
}

// Embedded boot image.
// Provided by `EMBED_FILES "boot.png"` in `main/CMakeLists.txt`.
extern const uint8_t boot_png_start[] asm("_binary_boot_png_start");
extern const uint8_t boot_png_end[]   asm("_binary_boot_png_end");

static const lv_image_dsc_t *board_boot_png_dsc(void)
{
    // IMPORTANT: LVGL keeps a pointer to the `lv_image_dsc_t` provided via `lv_image_set_src`.
    // So it must live for the lifetime of the image object (not on the stack).
    static lv_image_dsc_t s_dsc;
    static bool s_inited = false;
    if (!s_inited) {
        const uint8_t *start = &boot_png_start[0];
        const uint8_t *end = &boot_png_end[0];
        const size_t sz = (size_t)(end - start);
        s_dsc = (lv_image_dsc_t){
            .header.magic = LV_IMAGE_HEADER_MAGIC,
            .header.cf = LV_COLOR_FORMAT_RAW, // PNG bytes; decoded by LVGL lodepng
            .header.flags = 0,
            .header.w = 0,
            .header.h = 0,
            .header.stride = 0,
            .data_size = (uint32_t)sz,
            .data = start,
            .reserved = NULL,
            .reserved_2 = NULL,
        };
        s_inited = true;
    }
    return &s_dsc;
}

static bool board_png_get_wh(const uint8_t *png, size_t png_len, uint32_t *w, uint32_t *h)
{
    // PNG signature (8 bytes) + IHDR chunk:
    // - width @ offset 16..19 (big-endian)
    // - height @ offset 20..23 (big-endian)
    static const uint8_t magic[] = {0x89, 0x50, 0x4e, 0x47, 0x0d, 0x0a, 0x1a, 0x0a};
    if (png == NULL || png_len < 24) return false;
    if (memcmp(png, magic, sizeof(magic)) != 0) return false;
    uint32_t be_w = ((uint32_t)png[16] << 24) | ((uint32_t)png[17] << 16) | ((uint32_t)png[18] << 8) | (uint32_t)png[19];
    uint32_t be_h = ((uint32_t)png[20] << 24) | ((uint32_t)png[21] << 16) | ((uint32_t)png[22] << 8) | (uint32_t)png[23];
    if (be_w == 0 || be_h == 0) return false;
    *w = be_w;
    *h = be_h;
    return true;
}

static void board_display_init_and_show_image(void)
{
    lv_display_t *disp = bsp_display_start();
    if (disp == NULL) {
        ESP_LOGE(TAG, "Failed to start BSP display");
        return;
    }

    // Optional: set brightness (0-100). bsp_display_start() already initializes brightness.
    bsp_display_brightness_set(80);

    // LVGL is not thread-safe: always take the BSP LVGL lock before calling LVGL APIs.
    bsp_display_lock(0);

    const uint8_t *png_start = &boot_png_start[0];
    const uint8_t *png_end = &boot_png_end[0];
    if (png_end <= png_start) {
        ESP_LOGE(TAG, "boot.png not embedded or invalid (did you set EMBED_FILES \"boot.png\"?)");
        bsp_display_unlock();
        return;
    }

    lv_obj_t *scr = lv_screen_active();
    lv_obj_set_style_bg_color(scr, lv_color_hex(0x000000), 0);
    lv_obj_set_style_bg_opa(scr, LV_OPA_COVER, 0);

    // Diagnostics: confirm decoder + PNG size.
    uint32_t png_w = 0, png_h = 0;
    const size_t png_len = (size_t)(png_end - png_start);
    const bool wh_ok = board_png_get_wh(png_start, png_len, &png_w, &png_h);
    if (!wh_ok) {
        ESP_LOGW(TAG, "boot.png: failed to parse width/height (len=%u)", (unsigned)png_len);
    } else {
        // LVGL lodepng decodes to ARGB8888: 4 bytes/pixel.
        const uint64_t decoded_bytes = (uint64_t)png_w * (uint64_t)png_h * 4ULL;
        ESP_LOGI(TAG, "boot.png: %ux%u, embedded=%u bytes, decoded≈%u KB",
                 (unsigned)png_w, (unsigned)png_h, (unsigned)png_len, (unsigned)(decoded_bytes / 1024ULL));
    }

