livekit/client-sdk-esp32/components/livekit/examples/minimal/main/board.c
    // Centered column layout: logo + visualizer bar underneath.
    lv_obj_t *cont = lv_obj_create(scr);
    lv_obj_remove_style_all(cont);
    lv_obj_set_size(cont, LV_PCT(100), LV_PCT(100));
    lv_obj_set_flex_flow(cont, LV_FLEX_FLOW_COLUMN);
    lv_obj_set_flex_align(cont, LV_FLEX_ALIGN_CENTER, LV_FLEX_ALIGN_CENTER, LV_FLEX_ALIGN_CENTER);
    lv_obj_set_style_pad_row(cont, 12, 0);

    lv_obj_t *img = lv_image_create(cont);
    lv_image_set_src(img, board_boot_png_dsc());

    // Visualizer: a center-out meter looks nicer than a left-to-right fill.
    // We render a RANGE-mode bar and drive it with (-v..+v).
    // When silent, we hide the bar and show a small neutral ring instead.
    lv_obj_t *viz = lv_obj_create(cont);
    lv_obj_remove_style_all(viz);
    lv_obj_set_size(viz, 220, 20);

    s_visualizer_bar = lv_bar_create(viz);
    lv_obj_set_size(s_visualizer_bar, LV_PCT(100), LV_PCT(100));
    lv_obj_set_style_radius(s_visualizer_bar, 10, 0);
    // Black track so it blends into the screen background.
    lv_obj_set_style_bg_color(s_visualizer_bar, lv_color_hex(0x000000), 0);
    lv_obj_set_style_bg_opa(s_visualizer_bar, LV_OPA_COVER, 0);

    // Indicator gradient (left -> right), matching the reference image.
    lv_obj_set_style_bg_color(s_visualizer_bar, lv_color_hex(0xD86AAE), LV_PART_INDICATOR);      // pink-ish
    lv_obj_set_style_bg_grad_color(s_visualizer_bar, lv_color_hex(0x7B86FF), LV_PART_INDICATOR); // blue-ish
    lv_obj_set_style_bg_grad_dir(s_visualizer_bar, LV_GRAD_DIR_HOR, LV_PART_INDICATOR);
    lv_obj_set_style_bg_opa(s_visualizer_bar, LV_OPA_COVER, LV_PART_INDICATOR);

    // Center at 0; fill between start_value..value.
    lv_bar_set_mode(s_visualizer_bar, LV_BAR_MODE_RANGE);
    lv_bar_set_range(s_visualizer_bar, -100, 100);
    lv_bar_set_start_value(s_visualizer_bar, 0, LV_ANIM_OFF);
    lv_bar_set_value(s_visualizer_bar, 0, LV_ANIM_OFF);

    // Silent-state dot: filled with the midpoint purple of the gradient so the
    // transition to the bar looks seamless. Match diameter to bar height (20px).
    s_visualizer_dot = lv_obj_create(viz);
    lv_obj_remove_style_all(s_visualizer_dot);
    lv_obj_set_size(s_visualizer_dot, 20, 20);
    lv_obj_set_style_radius(s_visualizer_dot, LV_RADIUS_CIRCLE, 0);
    // Midpoint between 0xD86AAE and 0x7B86FF (approx).
    lv_obj_set_style_bg_color(s_visualizer_dot, lv_color_hex(0xA978D6), 0);
    lv_obj_set_style_bg_opa(s_visualizer_dot, LV_OPA_COVER, 0);
    lv_obj_set_style_border_width(s_visualizer_dot, 0, 0);
    lv_obj_align(s_visualizer_dot, LV_ALIGN_CENTER, 0, 0);

    // Connection-state dot (20px gray). This replaces the remote volume meter while disconnected/connecting.
    s_conn_dot = lv_obj_create(viz);
    lv_obj_remove_style_all(s_conn_dot);
    lv_obj_set_size(s_conn_dot, 20, 20);
    lv_obj_set_style_radius(s_conn_dot, LV_RADIUS_CIRCLE, 0);
    lv_obj_set_style_bg_color(s_conn_dot, lv_color_hex(0x808080), 0);
    lv_obj_set_style_bg_opa(s_conn_dot, LV_OPA_COVER, 0);
    lv_obj_set_style_border_width(s_conn_dot, 0, 0);
    lv_obj_align(s_conn_dot, LV_ALIGN_CENTER, 0, 0);

    // Mic input indicator (top-center): blue dot when silent, blue center-out bars when speaking.
    // Per UX: show only when unmuted; hide entirely when muted.
    s_mic_level_cont = lv_obj_create(scr);
    lv_obj_remove_style_all(s_mic_level_cont);
    lv_obj_set_size(s_mic_level_cont, 220, 20);
    lv_obj_clear_flag(s_mic_level_cont, LV_OBJ_FLAG_CLICKABLE);
    lv_obj_align(s_mic_level_cont, LV_ALIGN_TOP_MID, 0, 10);
    lv_obj_move_foreground(s_mic_level_cont);

    s_mic_level_bar = lv_bar_create(s_mic_level_cont);
    lv_obj_set_size(s_mic_level_bar, LV_PCT(100), LV_PCT(100));
    lv_obj_set_style_radius(s_mic_level_bar, 10, 0);
    // Black track to blend into the screen background.
    lv_obj_set_style_bg_color(s_mic_level_bar, lv_color_hex(0x000000), 0);
    lv_obj_set_style_bg_opa(s_mic_level_bar, LV_OPA_COVER, 0);

    // Blue gradient indicator.
    lv_obj_set_style_bg_color(s_mic_level_bar, lv_color_hex(0x2563EB), LV_PART_INDICATOR);      // deep blue
    lv_obj_set_style_bg_grad_color(s_mic_level_bar, lv_color_hex(0x60A5FA), LV_PART_INDICATOR); // light blue
    lv_obj_set_style_bg_grad_dir(s_mic_level_bar, LV_GRAD_DIR_HOR, LV_PART_INDICATOR);
    lv_obj_set_style_bg_opa(s_mic_level_bar, LV_OPA_COVER, LV_PART_INDICATOR);

    lv_bar_set_mode(s_mic_level_bar, LV_BAR_MODE_RANGE);
    lv_bar_set_range(s_mic_level_bar, -100, 100);
    lv_bar_set_start_value(s_mic_level_bar, 0, LV_ANIM_OFF);
    lv_bar_set_value(s_mic_level_bar, 0, LV_ANIM_OFF);

    // Silent-state dot (blue).
    s_mic_level_dot = lv_obj_create(s_mic_level_cont);
    lv_obj_remove_style_all(s_mic_level_dot);
    lv_obj_set_size(s_mic_level_dot, 20, 20);
    lv_obj_set_style_radius(s_mic_level_dot, LV_RADIUS_CIRCLE, 0);
    lv_obj_set_style_bg_color(s_mic_level_dot, lv_color_hex(0x3B82F6), 0);
    lv_obj_set_style_bg_opa(s_mic_level_dot, LV_OPA_COVER, 0);
    lv_obj_set_style_border_width(s_mic_level_dot, 0, 0);
    lv_obj_align(s_mic_level_dot, LV_ALIGN_CENTER, 0, 0);

    // Start with bar hidden (dot visible).
    lv_obj_add_flag(s_mic_level_bar, LV_OBJ_FLAG_HIDDEN);
    board_mic_indicator_apply(media_get_mic_muted());

#if !LV_USE_LODEPNG
    // Don't bail out: UI meters (and button handling) should still run even if the
    // boot PNG can't be decoded in this build.
    ESP_LOGW(TAG, "PNG decoder disabled: enable CONFIG_LV_USE_LODEPNG (boot image may not render)");
#else
    (void)wh_ok;
#endif

    // Timer-driven animation (runs in LVGL task context).
    if (s_visualizer_timer == NULL) {
        s_visualizer_timer = lv_timer_create(board_visualizer_timer_cb, 33, NULL);
    }

    // Start disconnected on boot per UX: show connection dot, hide remote meter.
    board_conn_ui_apply_locked(LIVEKIT_CONNECTION_STATE_DISCONNECTED);

    bsp_display_unlock();
}

void board_set_mic_muted(bool muted)
{
    // Safe to call from non-LVGL contexts.
    if (!bsp_display_lock(0)) {
        return;
    }
    board_mic_indicator_apply(muted);
    bsp_display_unlock();
}

