livekit/client-sdk-esp32/components/livekit/examples/minimal/main/board.c
void board_set_connection_state(livekit_connection_state_t state)
{
    // Safe to call from non-LVGL contexts.
    if (!bsp_display_lock(0)) {
        return;
    }
    board_conn_ui_apply_locked(state);
    bsp_display_unlock();
}

void *board_get_mic_handle(void)
{
    return s_mic_handle;
}

void *board_get_speaker_handle(void)
{
    return s_spk_handle;
}

static void IRAM_ATTR board_button_isr_cb(bsp_button_t button, void *ctx)
{
    (void)ctx;
    if (s_button_queue == NULL) return;
    const board_button_evt_t evt = {.button = button};
    BaseType_t hp_task_woken = pdFALSE;
    (void)xQueueSendFromISR(s_button_queue, &evt, &hp_task_woken);
    if (hp_task_woken == pdTRUE) {
        portYIELD_FROM_ISR();
    }
}

static void board_button_task_fn(void *arg)
{
    (void)arg;
    board_button_evt_t evt;
    bool upper_down = false;
    while (true) {
        if (xQueueReceive(s_button_queue, &evt, portMAX_DELAY) != pdTRUE) {
            continue;
        }
        if (evt.button != BSP_BUTTON_UPPER) {
            continue;
        }
        // Debounce + toggle-on-press:
        // - Wait a moment for bounce to settle
        // - Toggle only when we observe a stable transition to "pressed"
        vTaskDelay(pdMS_TO_TICKS(30));
        const int lvl = gpio_get_level(BSP_BUTTON_UPPER_IO); // 0 = pressed (pull-up)
        if (lvl == 0) {
            if (!upper_down) {
                upper_down = true;
                const bool muted = media_toggle_mic_muted();
                board_set_mic_muted(muted);
                ESP_LOGI(TAG, "Mic %s", muted ? "MUTED" : "UNMUTED");
            }
        } else {
            upper_down = false;
        }
    }
}

void board_init(void)
{
    ESP_LOGI(TAG, "Initializing board");

    // Initialize I2C (needed for codec + touch, etc.)
    ESP_ERROR_CHECK(bsp_i2c_init());

    // Initialize audio (I2S + codec devices) via BSP.
    //
    // Option A: true AEC reference on Mic3 requires ES7210 TDM output (>= 3 mics enabled).
    // ES8311 playback expects standard I2S framing, so we run:
    // - TX: standard I2S (playback)
    // - RX: TDM (capture Mic1/Mic2 + Ref Mic3)
    const i2s_std_config_t tx_cfg = {
        .clk_cfg = I2S_STD_CLK_DEFAULT_CONFIG(16000),
        .slot_cfg = I2S_STD_PHILIP_SLOT_DEFAULT_CONFIG(I2S_DATA_BIT_WIDTH_16BIT, I2S_SLOT_MODE_STEREO),
        .gpio_cfg = {
            .mclk = BSP_I2S_MCLK,
            .bclk = BSP_I2S_SCLK,
            .ws = BSP_I2S_LCLK,
            .dout = BSP_I2S_DOUT,
            .din = BSP_I2S_DSIN,
            .invert_flags = {
                .mclk_inv = false,
                .bclk_inv = false,
                .ws_inv = false,
            },
        },
    };
    const i2s_tdm_config_t rx_cfg = {
        .clk_cfg = I2S_TDM_CLK_DEFAULT_CONFIG(16000),
        .slot_cfg = I2S_TDM_PHILIPS_SLOT_DEFAULT_CONFIG(I2S_DATA_BIT_WIDTH_16BIT,
                                                        I2S_SLOT_MODE_STEREO,
                                                        (I2S_TDM_SLOT0 | I2S_TDM_SLOT1 | I2S_TDM_SLOT2 | I2S_TDM_SLOT3)),
        .gpio_cfg = {
            .mclk = BSP_I2S_MCLK,
            .bclk = BSP_I2S_SCLK,
            .ws = BSP_I2S_LCLK,
            .dout = BSP_I2S_DOUT,
            .din = BSP_I2S_DSIN,
            .invert_flags = {
                .mclk_inv = false,
                .bclk_inv = false,
                .ws_inv = false,
            },
        },
    };
    ESP_ERROR_CHECK(bsp_audio_init_tx_std_rx_tdm(&tx_cfg, &rx_cfg));

    s_spk_handle = bsp_audio_codec_speaker_init();
    ESP_RETURN_VOID_ON_FALSE(s_spk_handle != NULL, TAG, "Failed to init speaker codec device");

    s_mic_handle = bsp_audio_codec_microphone_init();
    ESP_RETURN_VOID_ON_FALSE(s_mic_handle != NULL, TAG, "Failed to init microphone codec device");

    // Boost microphone input gain (in dB).
    // ES7210 gain is fairly conservative by default; increasing it improves published mic level
    // without needing to add excessive post-AEC digital gain.
    //
    // If you hear clipping/distortion, reduce this value (e.g., 18.0-24.0).
    // If it's still too quiet, increase gradually (e.g., up to ~30.0).
    esp_codec_dev_set_in_gain(s_mic_handle, 30.0f);

    // Initialize display + touch and show a static image on boot.
    board_display_init_and_show_image();

    // Upper button toggles mic mute.
    // Use BSP minimal button API (GPIO0 by default).
    s_button_queue = xQueueCreate(4, sizeof(board_button_evt_t));
    if (s_button_queue != NULL) {
        ESP_ERROR_CHECK(bsp_button_init());
        ESP_ERROR_CHECK(bsp_button_register_callback(BSP_BUTTON_UPPER, board_button_isr_cb, NULL));
        (void)xTaskCreate(board_button_task_fn, "lk_btn_mute", 4096, NULL, 6, &s_button_task);
    } else {
        ESP_LOGW(TAG, "Failed to create button queue; mic mute toggle disabled");
    }
}

void board_visualizer_set_level(float level)
{
    // Called from audio render context; must not touch LVGL.
    if (level < 0.0f) level = 0.0f;
    if (level > 1.0f) level = 1.0f;
    const uint32_t q15 = (uint32_t)(level * 32767.0f);
    s_visualizer_level_q15 = (uint16_t)(q15 > 32767U ? 32767U : q15);
    board_level_log_maybe();
}

void board_mic_visualizer_set_level(float level)
{
    // Called from capture/audio context; must not touch LVGL.
    if (level < 0.0f) level = 0.0f;
    if (level > 1.0f) level = 1.0f;

    // Apply UI curve (purely visual).
    float ui = level;
    const float k = LK_MIC_UI_CURVE_K;
    if (k > 0.0f) {
        ui = log1pf(k * ui) / log1pf(k);
    }

    const uint32_t q15 = (uint32_t)(ui * 32767.0f);
    s_mic_level_q15 = (uint16_t)(q15 > 32767U ? 32767U : q15);
    board_level_log_maybe();
}